tsung/message.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/haowen/opt/tsung-1.7.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug">
        <!-- Client side setup -->
        <clients>
                <client host="localhost" use_controller_vm="true" maxusers='1500'/>
        </clients>
        <!-- Server side setup -->
        <servers>
                <server host="localhost" port="3000" type="tcp"></server>
        </servers>
        <load>
                <arrivalphase phase="1" duration="1" unit="second">
                        <users arrivalrate="1" unit="second"/>
                </arrivalphase>

        </load>
        <options>
                <option name="global_ack_timeout" value="2000"/>
        </options>
        <sessions>
                <!-- Register as a new user. -->
                <session name="register-edit-logout" probability="100" type="ts_http">
                        <!-- Randomly generate the username and password -->
                        <setdynvars sourcetype="random_string" length="10">
                                <var name="username" />
                                <var name="password" />
                        </setdynvars>
<!-- ==================================================== -->
                        <request subst="true">
                                <dyn_variable name="authenticity_token" re='name="authenticity_token" value="(.*)"'></dyn_variable>
                                <http url="/signup" version="1.1" method="GET"></http>
                        </request>
                                <thinktime value="2"></thinktime>

                        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
                                {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
                                edoc_lib:escape_uri(binary_to_list(Val)) end.">
                                <var name="escaped_authenticity_token" />
                        </setdynvars>

                        <!-- Create the random account and get the userid -->
                        <request subst="true">
                                <dyn_variable name="userid" re="[Ll]ocation: http://.*/users/([0-9]+)"></dyn_variable>
                                <http url='/users'
                                        version='1.1'
                                        method='POST'
                                        contents='authenticity_token=%%_escaped_authenticity_token%%&amp;user%5Busername%5D=%%_username%%&amp;user%5Bpassword%5D=%%_password%%&amp;user%5Bpassword_confirmation%5D=%%_password%%&amp;commit=Create+Account'
                                        content_type="application/x-www-form-urlencoded"/>
                        </request>
                                <thinktime value="2"></thinktime>
<!-- ==================================================== -->
                        <!-- Go to the settings page -->
                        <!-- <request subst="true">
                                <dyn_variable name="authenticity_token"></dyn_variable>
                                <http url="/users/%%_userid%%/edit" version="1.1" method="GET"/>
                        </request>

                        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
                                {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
                                edoc_lib:escape_uri(binary_to_list(Val)) end.">
                                <var name="escaped_authenticity_token" />
                        </setdynvars>
                                <thinktime value="2"></thinktime> -->

                        <!-- Update user's profile -->
                        <!-- <request subst="true">
                                <http url="/users/%%_userid%%"
                                        version="1.1"
                                        method="PATCH"
                                        contents="authenticity_token=%%_escaped_authenticity_token%%&amp;username=%%_username%%&amp;avatar=https://cdn.newsapi.com.au/image/v1/9fdbf585d17c95f7a31ccacdb6466af9&amp;originalpassword=%%_password%%;&amp;email=%%_username%%@gmail.com"
                                        content_type="application/x-www-form-urlencoded"/>
                        </request> -->
<!-- ====================================================== -->
                        <!-- <request subst="true">
                                <dyn_variable name="authenticity_token"></dyn_variable>
                                <http url="/rooms/new" version="1.1" method="GET"/>
                        </request>

                        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->
                                {ok, Val} = ts_dynvars:lookup(authenticity_token, DynVars),
                                edoc_lib:escape_uri(binary_to_list(Val)) end.">
                                <var name="escaped_authenticity_token" />
                        </setdynvars> -->

                        <!-- create user's room -->
                        <!-- <request subst="true">
                                <dyn_variable name="room_id" re="[Ll]ocation: http://.*/videorooms/([0-9]+)"></dyn_variable>
                                <http url="/rooms"
                                        version="1.1"
                                        method="POST"
                                        contents="authenticity_token=%%_escaped_authenticity_token%%&amp;room%5Bhost_id%5D=%%_userid%%&amp;room%5Broom_name%5D=%%_username%%&amp;room%5Blink_1%5D=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D2ZM8k2QTQk8&amp;commit=Create+Room"
                                        content_type="application/x-www-form-urlencoded"/>
                        </request> -->

<!-- ==================================================== --> 
                        <!-- Go to lobby and join room-->
                        <transaction name="get_lobby_join">
                                <request subst="true">
                                        <dyn_variable name="authenticity_token"></dyn_variable>
                                        <http url="/rooms" version="1.1" method="GET"/>
                                </request>
                                
                                <request subst="true">
                                <http url="/users/%%_userid%%/join"
                                        version="1.1"
                                        method="POST"
                                        contents="authenticity_token=%%_escaped_authenticity_token%%&amp;search=6&amp;id=%%_userid%%"
                                        content_type="application/x-www-form-urlencoded"/>
                                </request>
                        </transaction>

<!-- ==================================================== -->
                        <!-- chat in the chatroom -->
                        <change_type new_type="ts_websocket" host="localhost" server_type="tcp" port="3000" bidi="true"/>
                        <request>
                                <websocket type="connect" path="/cable" ></websocket>
                        </request>

                        <request subst="true">
                                <websocket type="message" frame="text">
                                        {"command":"subscribe","identifier":"{\"channel\":\"RoomChannel\"}"}
                                </websocket>
                        </request>
                        <thinktime min="1" max="2" random="true"/>
                        <request subst="true">
                                <websocket type="message" frame="text">
                                        {"command":"message","identifier":"{\"channel\":\"RoomChannel\"}","data":"{\"room_id\":6,\"content\":\"tsung\",\"action\":\"send_message\"}"}
                                </websocket>
                        </request>
                        <request>
                                <websocket type="close"></websocket>
                        </request>

<!-- ==================================================== -->
                        <!-- Logout
                        <change_type new_type="ts_http" host="localhost" server_type="tcp" port="3000" restore="true"/>
                        <request subst="true">
                                <http url="/logout" method="DELETE" />
                        </request> -->
                </session>

        </sessions>
</tsung>